Tekla Open API Reference for Tekla Structures 2025
ViewHandler.ZoomToBoundingBox Method
Overload List
Name | Description
ZoomToBoundingBox(AABB)
Zooms the current model view.
ZoomToBoundingBox(View, AABB)
Zooms a model view.
Top
See Also
Reference
ViewHandler Class
Tekla.Structures.Model.UI Namespace